Revit 2026 API

# ProductType Enumeration

---

An enumerated type containing the possible Revit product types.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ProductType
```
```vb
Public Enumeration ProductType
```
```cpp
public enum class ProductType
```
```fsharp
type ProductType
```

| Member name | Value | Description |
| --- | --- | --- |
| Architecture | 0 | Architecture. |
| LT | 4 | LT. |
| MEP | 2 | MEP. |
| Revit | 3 | Revit. |
| Structure | 1 | Structure. |
| Unknown | 5 | Unknown. |

#### Reference

Autodesk.Revit.ApplicationServices Namespace